import React from "react";

function AboutPage() {
  return (
    <div className="flex flex-col items-center justify-center bg-white px-6 py-12 min-h-[85vh]">
      <div className="max-w-2xl text-center text-gray-800">
        <p className="mb-6 leading-relaxed">
          Η εφαρμογή δημιουργήθηκε στο πλαίσιο προσωπικού project και αξιοποιεί
          δεδομένα που είναι διαθέσιμα δημόσια από επίσημους κυβερνητικούς
          φορείς. Στόχος της είναι η παρουσίαση αυτών των δεδομένων με φιλικό
          και κατανοητό τρόπο προς το κοινό.
        </p>
        <p className="mb-6 leading-relaxed">
          Βρίσκεται σε πειραματικό στάδιο και ενδέχεται να περιέχει σφάλματα ή
          ανακρίβειες. Αν έχετε οποιαδήποτε απορία ή πρόταση, μπορείτε να
          επικοινωνήσετε μαζί μου μέσω{" "}
          <a
            href="mailto:johnpapani1@gmail.com"
            className="text-blue-600 hover:underline"
          >
            αποστολής email
          </a>
          .
        </p>
        <hr className="w-48 h-1 mx-auto my-4 bg-gray-100 border-0 rounded-sm md:my-10 dark:bg-gray-700"></hr>
        <div className="font-semibold italic">
          <p>
            Open Data Hub HCAP - Πλατφόρμα Συνεργασίας και Αξιοποίησης Δεδομένων
            ~ O2HUB
          </p>
          <p>Υπερταμείο - Εταιρεία Διαχείρισης Ανοιχτών Δεδομένων</p>
        </div>

        <p className="my-6 text-xl font-semibold italic">Τι είναι το Ο2hub</p>
        <p className="leading-relaxed">
          Το O2hub είναι η ψηφιακή πλατφόρμα διάθεσης ανοικτών δεδομένων (Open
          Data) και ανοικτών προγραμματιστικών διεπαφών (Open APIs) από τις
          θυγατρικές εταιρείες του Υπερταμείου (ΕΕΣΥΠ). To Ο2hub στοχεύει στην
          αξιοποίηση της δυναμικής των ανοικτών δεδομένων που προέρχονται από
          τις εταιρείες του Υπερταμείου, μέσα από τη δημιουργία ενός ανοικτού,
          τεχνολογικού και ανθρώπινου οικοσυστήματος γνώσης, συνεργασίας και
          δεδομένων. Το Ο2hub φιλοδοξεί να συνεισφέρει στην ανάπτυξη, την
          επιχειρηματικότητα, την καινοτομία, τον ψηφιακό μετασχηματισμό και τη
          διαφάνεια σε σημαντικούς φορείς της ελληνικής κοινωνίας και οικονομίας
          και σε τομείς όπως η ενέργεια, το περιβάλλον, οι μεταφορές, τα δίκτυα,
          οι υποδομές και η εφοδιαστική αλυσίδα.
        </p>
      </div>
    </div>
  );
}

export default AboutPage;
